[Subtitles]
Sage_VO_Intro_01_live_Announcer_1=Danger! Excitement! Mustaches!
Sage_VO_Intro_01_live_Announcer_2=It's time for another episode of Vault Hunter Adventures, featuring Sir Hammerlock!
Sage_VO_Intro_02_live_Announcer_1=In this week's tale, our hard-boiled heroes travel to the savage continent of Aegrus!
Sage_VO_Intro_02_live_Announcer_2=Their goal? To uncover the most exotic creatures Pandora has to offer, and give 'em the old one-two!
Sage_VO_Intro_03_live_Announcer_1=But danger looms on the horizon for our swell swashbucklers
Sage_VO_Intro_03_live_Announcer_2=for while Handsome Jack may be gone, his legacy...
Sage_VO_Intro_04_live_Announcer_1=...lives on.
Sage_VO_Intro_Title= 